se-research/CaroloCup/sources/OpenDaVINCI-msv/msv/proxy-STM32F4/testsuites/STM32F4ProtocolTestSuite.h
/*
 * OpenDaVINCI.
 *
 * This software is open source. Please see COPYING and AUTHORS for further information.
 */

#ifndef CORE_STM32F4PROTOCOLTESTSUITE_H_
#define CORE_STM32F4PROTOCOLTESTSUITE_H_

#include "cxxtest/TestSuite.h"

#include <iostream>
#include <sstream>
#include <string>
#include <vector>

#include "core/data/Constants.h"

// Include local header files.
#include "../include/STM32F4Protocol.h"
#include "../include/STM32F4DataListener.h"

using namespace std;
using namespace msv;

class StringProtocolTest : public CxxTest::TestSuite, public core::wrapper::StringSender, public STM32F4DataListener {
    private:
        string m_dataToBeSent;
        vector<InfraredSensorMeasurement> m_IR;
        vector<UltrasonicSensorMeasurement> m_US;
        RazorMeasurement m_razor;
        STM32F4AccelerometerMeasurement m_acc;
        core::data::environment::VehicleData m_VD;

    public:
        StringProtocolTest() :
            m_dataToBeSent(""),
            m_IR(),
            m_US(),
            m_razor(),
            m_acc(),
            m_VD() {}

        void send(const string& data) {
            m_dataToBeSent = data;
        }

        std::string itos(uint32_t n)
	{
	   const int max_size = std::numeric_limits<int>::digits10 + 1 /*sign*/ + 1 /*0-terminator*/;
	   char buffer[max_size] = {0};
	   sprintf(buffer, "%d", n);
	   return std::string(buffer);
	}

	uint16_t stoi(std::string str)
	{
	   int i=0;
           uint16_t sum=0;
           while(str[i]!='\0'){
		if(str[i]<48 || str[i] > 57)
		   return 0;
		else{
		   sum = sum*10 + (str[i]-48);
		   i++;
		}
	   }
	   return sum;
	}

        virtual void nextMeasurement(const vector<InfraredSensorMeasurement> &measurement) {
            m_IR = measurement;
        }

        virtual void nextMeasurement(const vector<UltrasonicSensorMeasurement> &measurement) {
            m_US = measurement;
        }

        virtual void nextMeasurement(const RazorMeasurement &measurement) {
            m_razor = measurement;
        }

        virtual void nextMeasurement(const STM32F4AccelerometerMeasurement &measurement) {
            m_acc = measurement;
        }

        virtual void nextMeasurement(const core::data::environment::VehicleData &vehicleData) {
            m_VD = vehicleData;
        }

        uint32_t putValueAt(const uint32_t &value, const uint32_t &startBit) {
            return (value << startBit);
        }

        void testSTM32F4ProtocolRequest_1() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setStringSender(this);

            // In this string, the protocol will encode the data to be sent by a connection.
            m_dataToBeSent = "";
            TS_ASSERT(m_dataToBeSent.length() == 0); 

            // Actually send the data.
            protocol.request(STM32F4Protocol::NoData, 0, 0);

            // Check if the data was encoded correctly.
            uint16_t data = 0;
            data = stoi(m_dataToBeSent);

            // Unpack the data from the two bytes according to the protocol specification.
            uint8_t request = (data & 0xF);
            uint8_t speed = (data >> 4) & 0x3F;
            uint8_t steeringWheelAngle = (data >> 10) & 0x3F;

            // Assert the received data.
            TS_ASSERT(request == 0);
            TS_ASSERT(speed == 31);
            TS_ASSERT(steeringWheelAngle == 2);
        }

        void testSTM32F4ProtocolRequest_2() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setStringSender(this);

            // In this string, the protocol will encode the data to be sent by a connection.
            m_dataToBeSent = "";
            TS_ASSERT(m_dataToBeSent.length() == 0); 

            // Actually send the data.
            protocol.request(STM32F4Protocol::AllInfrareds, 2, 0);

            // Check if the data was encoded correctly.
            uint16_t data = 0;
            data = stoi(m_dataToBeSent);

            // Unpack the data from the two bytes according to the protocol specification.
            uint8_t request = (data & 0xF);
            uint8_t speed = (data >> 4) & 0x3F;
            uint8_t steeringWheelAngle = (data >> 10) & 0x3F;

            // Assert the received data.
            TS_ASSERT(request == 1);
            TS_ASSERT(speed == 63);
            TS_ASSERT(steeringWheelAngle == 2);
        }

        void testSTM32F4ProtocolRequest_3() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            m_razor = RazorMeasurement();

            stringstream dataStream;

            TS_ASSERT_DELTA(m_razor.yaw, 0, 1e-5);
            TS_ASSERT_DELTA(m_razor.roll, 0, 1e-5);
            TS_ASSERT_DELTA(m_razor.pitch, 0, 1e-5);

            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 3;
            uint8_t YAW = 255;
            uint8_t SIGN_YAW = 1;
            data = putValueAt(request, 0) |
                   putValueAt(YAW, 4) |
                   putValueAt(SIGN_YAW, 12) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT_DELTA(m_razor.yaw, -1 * YAW, 1e-5);
            TS_ASSERT_DELTA(m_razor.roll, 0, 1e-5);
            TS_ASSERT_DELTA(m_razor.pitch, 0, 1e-5);
        }

        void testSTM32F4ProtocolRequest_4() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

