se-research/CaroloCup/sources/OpenDaVINCI-msv/msv/proxy-STM32F4/testsuites/STM32F4ProtocolTestSuite.h
            m_razor = RazorMeasurement();

            stringstream dataStream;

            TS_ASSERT_DELTA(m_razor.mag_X, 0, 1e-5);
            TS_ASSERT_DELTA(m_razor.mag_Y, 0, 1e-5);
            TS_ASSERT_DELTA(m_razor.mag_Z, 0, 1e-5);

            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 4;
            uint8_t MAG_X = 255;
            uint8_t SIGN_MAG_X = 0;
            uint8_t MAG_Y = 255;
            uint8_t SIGN_MAG_Y = 1;
            data = putValueAt(request, 0) |
                   putValueAt(MAG_X, 4) |
                   putValueAt(SIGN_MAG_X, 12) |
                   putValueAt(MAG_Y, 13) |
                   putValueAt(SIGN_MAG_Y, 21) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT_DELTA(m_razor.mag_X, MAG_X, 1e-5);
            TS_ASSERT_DELTA(m_razor.mag_Y, -1 * MAG_Y, 1e-5);
            TS_ASSERT_DELTA(m_razor.mag_Z, 0, 1e-5);
        }

        void testSTM32F4ProtocolRequest_5() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            m_razor = RazorMeasurement();

            stringstream dataStream;

            TS_ASSERT_DELTA(m_razor.gyro_X, 0, 1e-5);
            TS_ASSERT_DELTA(m_razor.gyro_Y, 0, 1e-5);
            TS_ASSERT_DELTA(m_razor.gyro_Z, 0, 1e-5);

            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 5;
            uint8_t GYRO_X = 255;
            uint8_t SIGN_GYRO_X = 0;
            uint8_t GYRO_Y = 255;
            uint8_t SIGN_GYRO_Y = 1;
            data = putValueAt(request, 0) |
                   putValueAt(GYRO_X, 4) |
                   putValueAt(SIGN_GYRO_X, 12) |
                   putValueAt(GYRO_Y, 13) |
                   putValueAt(SIGN_GYRO_Y, 21) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT_DELTA(m_razor.gyro_X, GYRO_X, 1e-5);
            TS_ASSERT_DELTA(m_razor.gyro_Y, -1 * GYRO_Y, 1e-5);
            TS_ASSERT_DELTA(m_razor.gyro_Z, 0, 1e-5);
        }

        void testSTM32F4ProtocolRequest_6() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            m_razor = RazorMeasurement();

            stringstream dataStream;

            TS_ASSERT_DELTA(m_razor.acc_X, 0, 1e-5);
            TS_ASSERT_DELTA(m_razor.acc_Y, 0, 1e-5);
            TS_ASSERT_DELTA(m_razor.acc_Z, 0, 1e-5);

            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 6;
            uint8_t ACC_X = 255;
            uint8_t SIGN_ACC_X = 0;
            uint8_t ACC_Y = 255;
            uint8_t SIGN_ACC_Y = 1;
            data = putValueAt(request, 0) |
                   putValueAt(ACC_X, 4) |
                   putValueAt(SIGN_ACC_X, 12) |
                   putValueAt(ACC_Y, 13) |
                   putValueAt(SIGN_ACC_Y, 21) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT_DELTA(m_razor.acc_X, ACC_X, 1e-5);
            TS_ASSERT_DELTA(m_razor.acc_Y, -1 * ACC_Y, 1e-5);
            TS_ASSERT_DELTA(m_razor.acc_Z, 0, 1e-5);
        }

        void testSTM32F4ProtocolRequest_7() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            m_acc = STM32F4AccelerometerMeasurement();

            stringstream dataStream;

            TS_ASSERT_DELTA(m_acc.acc_X, 0, 1e-5);
            TS_ASSERT_DELTA(m_acc.acc_Y, 0, 1e-5);
            TS_ASSERT_DELTA(m_acc.acc_Z, 0, 1e-5);

            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 7;
            int16_t ACC_X = 255;
            uint8_t SIGN_ACC_X = 0;
            int16_t ACC_Y = 255;
            uint8_t SIGN_ACC_Y = 1;
            data = putValueAt(request, 0) |
                   putValueAt(ACC_X, 4) |
                   putValueAt(SIGN_ACC_X, 12) |
                   putValueAt(ACC_Y, 13) |
                   putValueAt(SIGN_ACC_Y, 21) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT_DELTA(m_acc.acc_X, ACC_X, 1e-5);
            TS_ASSERT_DELTA(m_acc.acc_Y, -1 * ACC_Y, 1e-5);
            TS_ASSERT_DELTA(m_acc.acc_Z, 0, 1e-5);
        }

        void testSTM32F4ProtocolRequest_10() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            m_VD = core::data::environment::VehicleData();

            stringstream dataStream;

