se-research/CaroloCup/sources/OpenDaVINCI-msv/msv/proxy-STM32F4/testsuites/STM32F4ProtocolTestSuite.h
            TS_ASSERT_DELTA(m_VD.getPosition().getX(), 0, 1e-5);
            TS_ASSERT_DELTA(m_VD.getPosition().getY(), 0, 1e-5);
            TS_ASSERT_DELTA(m_VD.getPosition().getZ(), 0, 1e-5);

            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 10;
            int32_t POS_X = 4095;
            uint8_t SIGN_POS_X = 0;
            int32_t POS_Y = 4095;
            uint8_t SIGN_POS_Y = 1;
            data = putValueAt(request, 0) |
                   putValueAt(POS_X, 4) |
                   putValueAt(SIGN_POS_X, 16) |
                   putValueAt(POS_Y, 17) |
                   putValueAt(SIGN_POS_Y, 29) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT_DELTA(m_VD.getPosition().getX(), POS_X/100.0, 1e-5);
            TS_ASSERT_DELTA(m_VD.getPosition().getY(), POS_Y * (-1)/100.0, 1e-5);
            TS_ASSERT_DELTA(m_VD.getPosition().getZ(), 0, 1e-5);
        }

        void testSTM32F4ProtocolRequest_11() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            m_VD = core::data::environment::VehicleData();

            stringstream dataStream;

            TS_ASSERT_DELTA(m_VD.getRelTraveledPath(), 0, 1e-5);
            TS_ASSERT_DELTA(m_VD.getAbsTraveledPath(), 0, 1e-5);

            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 11;
            uint32_t REL = 63;
            uint32_t ABS = 65535;
            data = putValueAt(request, 0) |
                   putValueAt(REL, 4) |
                   putValueAt(ABS, 10) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT_DELTA(m_VD.getRelTraveledPath(), 0.315, 1e-5);
            TS_ASSERT_DELTA(m_VD.getAbsTraveledPath(), 327.675, 1e-5);
        }

        void testSTM32F4ProtocolRequest_12() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            m_VD = core::data::environment::VehicleData();

            stringstream dataStream;

            TS_ASSERT_DELTA(m_VD.getVelocity().getX(), 0, 1e-5);
            TS_ASSERT_DELTA(m_VD.getVelocity().getY(), 0, 1e-5);
            TS_ASSERT_DELTA(m_VD.getVelocity().getZ(), 0, 1e-5);

            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 12;
            int32_t VEL_X = 511;
            uint8_t SIGN_VEL_X = 0;
            int32_t VEL_Y = 511;
            uint8_t SIGN_VEL_Y = 1;
            data = putValueAt(request, 0) |
                   putValueAt(VEL_X, 4) |
                   putValueAt(SIGN_VEL_X, 13) |
                   putValueAt(VEL_Y, 14) |
                   putValueAt(SIGN_VEL_Y, 23) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT_DELTA(m_VD.getVelocity().getX(), VEL_X/100.0, 1e-5);
            TS_ASSERT_DELTA(m_VD.getVelocity().getY(), VEL_Y * (-1)/100.0, 1e-5);
            TS_ASSERT_DELTA(m_VD.getVelocity().getZ(), 0, 1e-5);
        }

        void testSTM32F4ProtocolRequest_13() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            m_VD = core::data::environment::VehicleData();

            stringstream dataStream;

            TS_ASSERT_DELTA(m_VD.getRelTraveledPath(), 0, 1e-5);
            TS_ASSERT_DELTA(m_VD.getAbsTraveledPath(), 0, 1e-5);

            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 13;
            int32_t HEADING = 2047;
            data = putValueAt(request, 0) |
                   putValueAt(HEADING, 4) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT_DELTA(m_VD.getHeading(), fmod(2047/1000.0*core::data::Constants::PI, 2*core::data::Constants::PI), 1e-5);
        }

        void testSTM32F4Protocol_HandleRequest_Distances() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            m_IR.clear();
            m_US.clear();

            TS_ASSERT(m_IR.size() == 0);
            TS_ASSERT(m_US.size() == 0);

            stringstream dataStream;

