se-research/CaroloCup/sources/OpenDaVINCI-msv/msv/proxy-STM32F4/testsuites/STM32F4ProtocolTestSuite.h
            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 1;
            uint8_t IR1 = 30;
            uint8_t IR2 = 30;
            uint8_t IR3 = 30;

            data = putValueAt(request, 0) |
                   putValueAt(IR1, 4) |
                   putValueAt(IR2, 9) |
                   putValueAt(IR3, 14) |
                   putValueAt(1, 30);

            data = request | (IR1 << 4) | (IR2 << 9) | (IR3 << 14) | (1<<30);
            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));
            // Check if the data was encoded correctly.
            data = 0;
            request = 2;
            uint32_t US1 = 63; uint32_t US1_multiplier = 0;
            uint32_t US2 = 63; uint32_t US2_multiplier = 1;
            uint32_t US3 = 63; uint32_t US3_multiplier = 2;

            data = putValueAt(request, 0) |
                   putValueAt(US1, 4) |
                   putValueAt(US1_multiplier, 10) |
                   putValueAt(US2, 12) |
                   putValueAt(US2_multiplier, 18) |
                   putValueAt(US3, 20) |
                   putValueAt(US3_multiplier, 26) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT(m_IR.size() == 3);
            TS_ASSERT(m_IR.at(0).address == 200);
            TS_ASSERT(m_IR.at(0).value == 30);
            TS_ASSERT(m_IR.at(1).address == 201);
            TS_ASSERT(m_IR.at(1).value == 30);
            TS_ASSERT(m_IR.at(2).address == 202);
            TS_ASSERT(m_IR.at(2).value == 30);

            TS_ASSERT(m_US.size() == 3);
            TS_ASSERT(m_US.at(0).address == 100);
            TS_ASSERT(m_US.at(0).value == 63*1);
            TS_ASSERT(m_US.at(1).address == 101);
            TS_ASSERT(m_US.at(1).value == 63*3);
            TS_ASSERT(m_US.at(2).address == 102);
            TS_ASSERT(m_US.at(2).value == 63*5);
        }

        void testSTM32F4Protocol_HandleRequest_Distances_Infinity() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            m_IR.clear();
            m_US.clear();

            TS_ASSERT(m_IR.size() == 0);
            TS_ASSERT(m_US.size() == 0);

            stringstream dataStream;

            // Check if the data was encoded correctly.
            uint32_t data = 0;
            uint8_t request = 1;
            uint8_t IR1 = 31;
            uint8_t IR2 = 31;
            uint8_t IR3 = 31;

            data = putValueAt(request, 0) |
                   putValueAt(IR1, 4) |
                   putValueAt(IR2, 9) |
                   putValueAt(IR3, 14) |
                   putValueAt(1, 30);

            data = request | (IR1 << 4) | (IR2 << 9) | (IR3 << 14) | (1<<30);
            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));
            // Check if the data was encoded correctly.
            data = 0;
            request = 2;
            uint32_t US1 = 63; uint32_t US1_multiplier = 3;
            uint32_t US2 = 63; uint32_t US2_multiplier = 3;
            uint32_t US3 = 63; uint32_t US3_multiplier = 3;

            data = putValueAt(request, 0) |
                   putValueAt(US1, 4) |
                   putValueAt(US1_multiplier, 10) |
                   putValueAt(US2, 12) |
                   putValueAt(US2_multiplier, 18) |
                   putValueAt(US3, 20) |
                   putValueAt(US3_multiplier, 26) |
                   putValueAt(1, 30);

            data = ntohl(data);
            dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

            // The protocol buffer must be zero.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
            protocol.receivedPartialString(dataStream.str());
            // The protocol buffer must be still be zero because it has been completely handled.
            TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

            TS_ASSERT(m_IR.size() == 3);
            TS_ASSERT(m_IR.at(0).address == 200);
            TS_ASSERT(m_IR.at(0).value == -1);
            TS_ASSERT(m_IR.at(1).address == 201);
            TS_ASSERT(m_IR.at(1).value == -1);
            TS_ASSERT(m_IR.at(2).address == 202);
            TS_ASSERT(m_IR.at(2).value == -1);

            TS_ASSERT(m_US.size() == 3);
            TS_ASSERT(m_US.at(0).address == 100);
            TS_ASSERT(m_US.at(0).value == -1);
            TS_ASSERT(m_US.at(1).address == 101);
            TS_ASSERT(m_US.at(1).value == -1);
            TS_ASSERT(m_US.at(2).address == 102);
            TS_ASSERT(m_US.at(2).value == -1);
        }

        void testSTM32F4Protocol_IterateAllIR() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

            // Check if the data was encoded correctly.
            for(uint8_t IR1 = 0; IR1 < 29; IR1++) {
                uint8_t IR2 = IR1+1;
                uint8_t IR3 = IR1+2;
                m_IR.clear();
                m_US.clear();

                TS_ASSERT(m_IR.size() == 0);
                TS_ASSERT(m_US.size() == 0);

                stringstream dataStream;

                uint32_t data = 0;
                uint8_t request = 1;

                data = putValueAt(request, 0) |
                       putValueAt(IR1, 4) |
                       putValueAt(IR2, 9) |
                       putValueAt(IR3, 14) |
                       putValueAt(1, 30);

                data = ntohl(data);
                dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));

                // The protocol buffer must be zero.
                TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
                protocol.receivedPartialString(dataStream.str());
                // The protocol buffer must be still be zero because it has been completely handled.
                TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

                TS_ASSERT(m_IR.size() == 3);
                TS_ASSERT(m_IR.at(0).address == 200);
                TS_ASSERT(m_IR.at(0).value == IR1);
                TS_ASSERT(m_IR.at(1).address == 201);
                TS_ASSERT(m_IR.at(1).value == IR2);
                TS_ASSERT(m_IR.at(2).address == 202);
                TS_ASSERT(m_IR.at(2).value == IR3);
            }
        }

        void testSTM32F4Protocol_IterateAllUS() {
            // Instantiate the actual protocol.
            STM32F4Protocol protocol;
            protocol.setSTM32F4DataListener(this);

