se-research/CaroloCup/sources/OpenDaVINCI-msv/msv/proxy-STM32F4/testsuites/STM32F4ProtocolTestSuite.h
            // Check if the data was encoded correctly.
            for(uint8_t US1 = 0; US1 < 61; US1++) {
                uint8_t US2 = US1+1;
                uint8_t US3 = US1+2;
                m_IR.clear();
                m_US.clear();

                TS_ASSERT(m_IR.size() == 0);
                TS_ASSERT(m_US.size() == 0);

                stringstream dataStream;

                uint8_t request = 2;
                uint32_t US1_multiplier = 0;
                uint32_t US2_multiplier = 1;
                uint32_t US3_multiplier = 2;
                uint32_t data = putValueAt(request, 0) |
                       putValueAt(US1, 4) |
                       putValueAt(US1_multiplier, 10) |
                       putValueAt(US2, 12) |
                       putValueAt(US2_multiplier, 18) |
                       putValueAt(US3, 20) |
                       putValueAt(US3_multiplier, 26) |
                       putValueAt(2, 30);

                data = ntohl(data);
                dataStream.write(reinterpret_cast<char*>(&data), sizeof(uint32_t));
		
                // The protocol buffer must be zero.
                TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);
                protocol.receivedPartialString(dataStream.str());
                // The protocol buffer must be still be zero because it has been completely handled.
                TS_ASSERT(protocol.getSizeOfUnhandledData() == 0);

                TS_ASSERT(m_US.size() == 3);
                TS_ASSERT(m_US.at(0).address == 100);
                TS_ASSERT(m_US.at(0).value == US1*1);
                TS_ASSERT(m_US.at(1).address == 101);
                TS_ASSERT(m_US.at(1).value == US2*3);
                TS_ASSERT(m_US.at(2).address == 102);
                TS_ASSERT(m_US.at(2).value == US3*5);
            }
        }

};

#endif /*CORE_STM32F4PROTOCOLTESTSUITE_H_*/
